Revit 2025 API
CommonSharedAssetType Enumeration
 The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CommonSharedAssetType
Public Enumeration CommonSharedAssetType
public enum class CommonSharedAssetType
type CommonSharedAssetType
Members
Member name | Value | Description
Shared | 0
Independent | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace